<template>
  <div class="body" v-loading="loading">
    <div class="head">
      <div class="n">
        <span>安全生产制度</span>
        <img src="@/assets/img/yellowMore.png" alt />
      </div>
    </div>
    <div class="content">
      1.深化安全生产责任体系建设
      为做好基层安全生产工作，提高霸州生产责任安全系数，霸州市财政划拨了专项经费在各乡镇设置了安全生产监督管理站，确保安全基础工作纵向到底。进一步完善工作机制，夯实责任体系，严格按照有关标准加强建设，制定党政领导干部安全生产包联责任制，建立了网格化责任体系，明确了各项规章制度，积极落实‘三清单’机制，以高度的政治责任感做好各项安全生产工作，深化安全责任体质建设，打造安全霸州，保障生产安全。
      霸州市以安全生产月为契机，强化针对性措施，在全市各生产经营单位全方位开展安全事故隐患自查自纠，对本单位重要部位、重点设备、薄弱环节进行隐患排查和整治。同时，霸州市深化安全生产责任体系建设、加快推进安全生产改革发展、继续开展重点行业领域专项整治、严格安全生产监管执法，努力实现安全生产形势持续稳定，保障安全生产工作有序进行。
      霸州市以党的十九大精神为指引，深入贯彻落实习近平总书记关于安全生产工作的重要论述和指示精神，强化红线意识、底线意识，在全市掀起了一场安全生产工作风暴。为加强对安全生产工作的领导，霸州市研究制定了“1234”工作推进机制。
      “一案”就是一个专项工作推进方案。“两图”就是制定工作流程图和责任压实图。“三清单”就是领导干部责任清单、隐患排查清单和问题整改落实清单。每一名干部都明确了包联的企业、片区、环节，对所有排查出的问题隐患做到底数清、情况明，每一个整改完毕的问题隐患都逐一销号。“四笔账”就是建账、要账、追账、算账。把建立工作台账作为推进工作的“牛鼻子”，就是要分门别类地兜清底数，落实分包责任人。市委、市政府按照清单逐一要账，做到整改一项、完成一项、销号一项。同时对工作不力造成恶劣影响的相关人员进行严厉追责问责，绝不容忍。
      生命之重大于一切，保障生产安全是发展之本，深化安全生产责任体系，不仅是为了霸州未来打下坚实的根基，更是推动霸州稳步发展的动力。
      2.安全生产工作要点
      一是创建“平安大道”建设。以通车环境安全为重点，加强对路面病害、交通设施（防撞护栏、隔离栅等）损毁的修复；加强对专项及日常养护工程作业现场管理，保证施工作业安全；加强对所辖路面、路基、桥涵和沿线设施的巡查监测和病害处置；加大路况巡查和清扫力度，及时清除影响行车安全的障碍物、散落物；及时发现、制止、上报危及公路运营安全的一切行为。
      二是创建“平安工区”建设。加强对重点部位的隐患排查；加强对食堂食品安全、警卫室安全保卫管理工作，及时消除隐患；深化消防安全“四个能力”建设，开展重点时期消防安全检查，严防火灾事故发生；时刻掌握职工队伍思想动态，化解矛盾纠纷，保证职工思想情绪稳定。
      三是制定并落实安全生产宣传教育培训年度计划。制定工区年度安全生产教育培训计划，按计划开展全员教育培训活动，确保各岗位从业人员掌握安全生产知识、熟悉安全生产制度、具备安全生产技能，做安全生产上的“明白人”；做到 “警钟长鸣，防患于未然”，坚持工作部署和安全警示教育同步进行，时刻把安全提醒挂在嘴边，提高安全防范意识，确保不发生任何安全生产责任事故。
      四是全力维护重点时期生产安全，切实做好全国“两会”及敏感时期和春节春运、中秋国庆等重要节假日的安全生产工作。适时提高防控等级，加大巡查巡视力度，做好应急准备，制定采取切实有效的事故防范应对措施，全力确保敏感时期和重要节假日期间人民群众的安全便捷出行。
      五是切实做好暑期汛期和冬季等重点时期的安全生产工作。针对汛期防汛、除雪保畅等恶劣天气和自然灾害，制定切实可行的应急保畅预案，并开展实战演练。建立健全应急救援保畅组织机构和机制。做好应急运力和设施设备、物资器材的储备工作，确保积极应对重点时期的突发事件，保障重点时期公路安全畅通。
      六是严格落实24小时值班制度。严格执行夜间轮流值班制度，保证值班电话24小时畅通，保证随时应对突发事件。
      七是做好养护机械设备的日常管理工作，加强设备维修保养和安全隐患的排查工作，保证机械设备不带病作业。坚持特种作业人员持证上岗，并对司机定期开展安全教育培训。
      八是开展“安全生产月”和“《安全生产法》宣传周”主题活动，围绕“平安交通、人人有责”的活动主题，通过制作悬挂标语，满意度调查等方式，开展“平安交通”宣传工作，大力营造全社会关注、支持和参与“平安交通 平安保津”建设的良好氛围.
      3.国务院安委会部署开展全国安全生产专项整治三年行动
      为认真贯彻落实习近平总书记关于安全生产重要论述，从根本上消除事故隐患，国务院安委会日前印发《全国安全生产专项整治三年行动计划》，在全国部署开展安全生产专项整治三年行动。专项整治三年行动从2020年4月启动至2022年12月结束，分为动员部署、排查整治、集中攻坚和巩固提升四个阶段。
      据悉，《行动计划》包括专项整治三年行动计划总方案和11个专项实施方案，分别是“学习宣传贯彻习近平总书记关于安全生产重要论述”、“落实企业安全生产主体责任”2个专题，危险化学品、煤矿、非煤矿山、消防、道路运输、交通运输（民航、铁路、邮政、水上和城市轨道交通）和渔业船舶、城市建设、工业园区等功能区、危险废物等安全整治9个专项。推动地方各级党委政府、有关部门和企业单位坚持以习近平总书记关于安全生产重要论述武装头脑、指导实践，务必把安全生产摆到重要位置，切实解决思想认知不足、安全发展理念不牢和抓落实存在很大差距等突出问题；完善和落实安全生产责任和管理制度，健全落实党政同责、一岗双责、齐抓共管、失职追责的安全生产责任制，强化党委政府领导责任、部门监管责任和企业主体责任；建立公共安全隐患排查和安全预防控制体系，推进安全生产由企业被动接受监管向主动加强管理转变、安全风险管控由政府推动为主向企业自主开展转变、隐患排查治理由部门行政执法为主向企业日常自查自纠转变；完善安全生产体制机制法制，大力推动科技创新，持续加强基础建设，全面提升本质安全水平。到2022年底，力争实现切实消除一批重大隐患、形成一批制度成果，建立健全公共安全隐患排查和安全预防控制体系，扎实推进安全生产治理体系和治理能力现代化，实现事故总量和较大事故持续下降，重特大事故有效遏制，全国安全生产整体水平明显提高，为全面维护好人民群众生命财产安全和经济高质量发展、社会和谐稳定提供有力的安全生产保障。
      《行动计划》提出，各地区、各有关部门和单位要加强组织领导，深刻认识做好专项整治三年行动的重要性，强化领导责任，勇于担当作为，层层抓好组织实施；完善法规制度，注重运用法治思维和法治方式，推动解决安全生产重点难点问题，制修订一批安全生产强制性国家标准、行业标准；强化保障能力，完善支持安全生产工作政策体系，强化中央和地方财政对安全生产工作的经费保障，培育发展一批有实力的安全技术服务机构；改进监管方式，实施分级分类精准化执法、差异化管理，深入开展“四不两直”明查暗访、异地交叉检查，加强宣传教育；严格问效问责，加强督促检查，对整治工作不负责、不作为，逾期没有完成目标任务的，坚决问责，确保整治工作取得实实在在成效。
    </div>
  </div>
</template>

<script>
export default {
  props: ["articleList"],
  data() {
    return {
      loading: false
    };
  },
  watch: {
    articleList: {
      handler(val) {},
      immediate: true,
      deep: true
    }
  },
  created() {},
  beforeDestroy() {},
  methods: {}
};
</script>
<style lang="less" scoped>
@import (reference) "~@/assets/css/common.less";
.body {
  height: 30%;
  .pt24;
  width: 100%;
  line-height: 22px;
  font-size: 15px;
  overflow: hidden;
  .head {
    .fb-left;
    .pb10;
    .pr;
    z-index: 2;
    .n {
      &:after {
        content: "";
        width: 30px;
        height: 1px;
        height: 2px;
        background: @theme-color;
        .db;
        .pa;
      }
      .fb-box-flex(1);
      .pr10;
      color: @base-font-color;
      span {
        margin-right: 8px;
      }
    }
    .more {
      color: @base-font-color;
      .tr;
      cursor: pointer;
    }
  }
  .content {
    .theme-color-3;
    .pr;
    padding: 4px;
    z-index: 2;
    height: 100%;
    color: @base-font-color;
    opacity: 0.8;
    overflow-y: scroll;
    padding-bottom:100px;
    &::-webkit-scrollbar {
      display: none;
    }
  }
}
</style>
