// 地图绝对中心点
export default [
    // 市级 廊坊 
    {   
        name: '廊坊市',
        regionId: '131000000000',
        cityId: '101090601',
        mapData: {
            "131082000000": {id:'三河市title', radius: 0, max: 15, bg: '#86f185'},
            "131024000000": {id:'香河县title', radius: 0, max: 15, bg: '#86f185'},
            "131002000000": {id:'安次区title', radius: 0, max: 15, bg: '#86f185'},
            "131023000000": {id:'永清县title', radius: 0, max: 15, bg: '#86f185'},
            "131081000000": {id:'霸州市title', radius: 0, max: 15, bg: '#86f185'},
            "131026000000": {id:'文安县title', radius: 0, max: 15, bg: '#86f185'},
        }
    },
    // 霸州
    {
        color: '',
        name: '霸州市',
        regionId: '131081000000',
        regionCenter: [116.575389,39.026079],
        adcode: 131081,
        cityId: '101090608',
        mapData: {
            "131081106000": {id:'杨芬港镇_2', radius: 0, max: 15, bg: '#86f185'},
            "131081204000": {id:'东段乡-2', radius: 0, max: 15, bg: '#86f185'},
            "131081450000": {id:'霸州经济技术开发区-2', radius: 0, max: 15, bg: '#86f185'},
            "131081203000": {id:'王庄子镇', radius: 0, max: 15, bg: '#86f185'},
            "131081107000": {id:'辛章办事处', radius: 0, max: 15, bg: '#86f185'},
            "131081200000": {id:'岔河集乡-2', radius: 0, max: 15, bg: '#86f185'},
            "131081201000": {id:'康仙庄镇', radius: 0, max: 15, bg: '#86f185'},
            "131081101000": {id:'南孟镇-2', radius: 0, max: 15, bg: '#86f185'},
            "131081103000": {id:'堂二里镇-2', radius: 0, max: 15, bg: '#86f185'},
            "131081100000": {id:'霸州镇-2', radius: 0, max: 15, bg: '#86f185'},
            "131081104000": {id:'煎茶铺镇-2', radius: 0, max: 15, bg: '#86f185'},
            "131081202000": {id:'东杨庄乡-2', radius: 0, max: 15, bg: '#86f185'},
            "131081105000": {id:'胜芳镇-2', radius: 0, max: 15, bg: '#86f185'},
            "131081102000": {id:'信安镇-2', radius: 0, max: 15, bg: '#86f185'}
        }
    },
    // 安次
    {
        color: '',
        name: '安次区',
        regionId: '131002000000',
        regionCenter: [116.729828,39.272745],
        adcode: 131002,
        // FIXME: 需修改
        cityId: '101090610',
        mapData: {
            "131002103000": {id:'东沽港镇-2', radius: 0, max: 15, bg: '#86f185'},
            "131002102000": {id:'葛渔城镇-2', radius: 0, max: 15, bg: '#86f185'},
            "131002101000": {id:'码头镇-2', radius: 0, max: 15, bg: '#86f185'},
            "131002104000": {id:'调河头镇-2', radius: 0, max: 15, bg: '#86f185'},
            "131002100000": {id:'落垡镇-2', radius: 0, max: 15, bg: '#86f185'},
            "131002201000": {id:'仇庄乡-2', radius: 0, max: 15, bg: '#86f185'},
            "131002200000": {id:'杨税务乡-2', radius: 0, max: 15, bg: '#86f185'},
            "131002203000": {id:'北史家务乡-2', radius: 0, max: 15, bg: '#86f185'}
        }
    },
    // 永清
    {
        color: '',
        name: '永清县',
        regionId: '131023000000',
        regionCenter: [116.512602,39.224221],
        adcode: 131023,
        cityId: '101090603',
        mapData: {
            "131023200000": {id:'管家务回族乡-2', radius: 0, max: 15, bg: '#86f185'},
            "131023201000": {id:'曹家务乡-2', radius: 0, max: 15, bg: '#86f185'},
            "131023101000": {id:'韩村镇-2', radius: 0, max: 15, bg: '#86f185'},
            "131023100000": {id:'永清镇-2', radius: 0, max: 15, bg: '#86f185'},
            "131023103000": {id:'别古庄镇-2', radius: 0, max: 15, bg: '#86f185'},
            "131023104000": {id:'里澜城镇-2', radius: 0, max: 15, bg: '#86f185'},
            "131023102000": {id:'后奕镇-2', radius: 0, max: 15, bg: '#86f185'},
            "131023202000": {id:'龙虎庄乡-2', radius: 0, max: 15, bg: '#86f185'},
            "131023203000": {id:'刘街乡-2', radius: 0, max: 15, bg: '#86f185'},
            "131023204000": {id:'三圣口乡-2', radius: 0, max: 15, bg: '#86f185'}
        }
    },
    // 香河
    {
        color: '',
        name: '香河县',
        regionId: '131024000000',
        regionCenter: [117.02252,39.672728],
        adcode: 131024,
        cityId: '101090604',
        mapData: {
            "131024104000": { id: "安平镇-2", radius: 0, max: 15, bg: "#86f185" },
            "131024108000": { id: "钳屯镇-2", radius: 0, max: 15, bg: "#86f185" },
            "131024106000": { id: "五百户镇-2", radius: 0, max: 15, bg: "#86f185" },
            "131024105000": { id: "刘宋镇-2", radius: 0, max: 15, bg: "#86f185" },
            "131024103000": { id: "安头屯镇-2", radius: 0, max: 15, bg: "#86f185" },
            "131024100000": { id: "淑阳镇-2", radius: 0, max: 15, bg: "#86f185" },
            "131024102000": { id: "渠口镇-2", radius: 0, max: 15, bg: "#86f185" },
            "131024107000": { id: "钱旺镇-2", radius: 0, max: 15, bg: "#86f185" },
            "131024101000": { id: "蒋辛屯镇-2", radius: 0, max: 15, bg: "#86f185" }
        }
    },
    // 三河
    {
        color: '',
        name: '三河市',
        regionId: '131082000000',
        regionCenter: [117.021137,39.91044],
        adcode: 131082,
        cityId: '101090609',
        mapData: {
            "131082104000": { id: '新集镇-2', radius: 0, max: 15, bg: "#86f185" },
            "131082103000": { id: '皇庄镇-2', radius: 0, max: 15, bg: "#86f185" },
            "131082102000": { id: "杨庄镇-2", radius: 0, max: 15, bg: "#86f185" },
            "131082101000": { id: "李旗庄镇-2", radius: 0, max: 15, bg: "#86f185" },
            "131082105000": { id: "段甲岭镇-2", radius: 0, max: 15, bg: "#86f185" },
            "131082106000": { id: "黄土庄-2", radius: 0, max: 15, bg: "#86f185" },
            "131082100000": { id: "泃阳镇-2", radius: 0, max: 15, bg: "#86f185" },
            "131082108000": { id: "齐心庄镇-2", radius: 0, max: 15, bg: "#86f185" },
            "131082107000": { id: "高楼镇-2", radius: 0, max: 15, bg: "#86f185" },
            "131082109000": { id: "燕郊镇-2", radius: 0, max: 15, bg: "#86f185" },
        }
    },
    // 文安
    {
        color: '',
        name: '文安县',
        regionId: '101010000000',
        regionCenter: [116.458663,38.824652],
        adcode: 131026,
        cityId: '101090606',
        mapData: {
            "101010180000": {id:'兴隆宫镇-2', radius: 0, max: 15, bg: '#86f185'},
            "101010190000": {id:'大留镇镇-2', radius: 0, max: 15, bg: '#86f185'},
            "101010160000": {id:'史各庄镇-2', radius: 0, max: 15, bg: '#86f185'},
            "101010220000": {id:'大围河回族满族乡-2', radius: 0, max: 15, bg: '#86f185'},
            "101010110000": {id:'新镇镇-2', radius: 0, max: 15, bg: '#86f185'},
            "101010120000": {id:'苏桥镇-2', radius: 0, max: 15, bg: '#86f185'},
            "101010130000": {id:'大柳河镇-2', radius: 0, max: 15, bg: '#86f185'},
            "101010140000": {id:'左各庄镇-2', radius: 0, max: 15, bg: '#86f185'},
            "101010150000": {id:'滩里镇-2', radius: 0, max: 15, bg: '#86f185'},
            "101010210000": {id:'德归镇-2', radius: 0, max: 15, bg: '#86f185'},
            "101010100000": {id:'文安镇-2', radius: 0, max: 15, bg: '#86f185'},
            "101010200000": {id:'孙氏镇-2', radius: 0, max: 15, bg: '#86f185'},
            "101010170000": {id:'赵各庄镇-2', radius: 0, max: 15, bg: '#86f185'}
        }
    },
    // 以下为未对接数据的地区 只显示地区区块

    // 广阳区
    {
        color: '',
        name: '广阳区',
        regionId: '131003000000',
        regionCenter: [116.588663,39.524652],
        adcode: 131003,
        cityId: '101090601',
    },
    // 固安县
    {
        color: '',
        name: '固安县',
        regionId: '131022000000',
        regionCenter: [116.258663,39.254652],
        adcode: 131022,
        cityId: '101090601',
    },
    // 大城县
    {
        color: '',
        name: '大城县',
        regionId: '131025000000',
        regionCenter: [116.528663,38.621652],
        adcode: 131025,
        cityId: '101090601',
    },
    // 大厂回族自治县
    {
        color: '',
        name: '大厂回族自治县',
        regionId: '131028000000',
        regionCenter: [116.828663,39.824652],
        adcode: 131028,
        cityId: '101090601',
    },
    // 廊坊经济技术开发区
    {
        color: '',
        name: '廊坊经济技术开发区',
        regionId: '131071000000',
        regionCenter: [116.458663,38.824652],
        adcode: 131071,
        cityId: '101090601',
    }
]
