export default {

	// 告警类型 1 生产设备，2 基础管理， 3 作业安全，4 消防设备
	alarmType: {
		"1": '生产设备',
		"2": '基础管理',
		"3": '作业安全',
		"4": '消防设备',
	},
	// 台账状态 0正常，1有告警，2已处理
	ledgerStat: {
		"0": '正常',
		"1": '有告警',
		"2": '已处理',
	},
	//台账类型
	ledgerType: {
		"1": '生产设备',
		"2": '基础管理',
		"3": '作业安全',
	},
	//设备状态/消防状态
	devStat: {
		"1": '正常',
		"2": '告警',
		"4": '离线',
		"8": '故障'
	},
	//厂房类型
	factoryType: {
		"0": '正常',
		"1": '有告警',
		"2": '已处理',
	},
	//企业台账类型
	ledgerCycleType: {
		"0": '正常',
		"1": '有告警',
		"2": '已处理',
	},
	//处理方式
	ledgerDealWay: {},
	//消息类型
	msgType: {
		"0": '正常',
		"1": '有告警',
		"2": '已处理',
	},
	//性别
	sex: {
		"0": '未知',
		"1": '男',
		"2": '女'
	},
	// 监控类型
	mtype: {
		"1": '在逃人员',
		"2": '重点监控人员',
		"3": '信访人员'
	},
	// 公司状态
	monStat: {
		"0": "正常",
		"1": "违规",
		"2": "停工"
	},
	//违规类型
	violationType: {
		'1': '未开启治污设备',
		'2': '未响应停产',
		'4': '未响应限产',
		'8': '排放异常'
	},
	//处理措施
	deal: {
		'0': '未处理',
		'1': '停产整改',
		'2': '断电封停',
		'3': '立案处罚',
		'4': '移交公安机关',
	},
	ageType: {
		'1': '<20岁',
		'2': '20~30岁',
		'3': '31~40岁',
		'4': '41~50岁',
		'5': '>50岁',
	},
	railType: {
		1: '圆形',
		2: '矩形',
		3: '多边形'
	},
	// 派单状态
	status: {
		0: '派单中',
		1: '已超时',
		2: '已受理',
		3: '已处理'
	},
	statusColor: {
		0: '#53ac85',
		1: '#FB7170',
		2: 'rgba(88, 195, 72, .8)',
		3: 'rgba(88, 195, 72, .5)'
	},
	devTypeIcon: {},
	devType: {},
	mapKey: {},
	ledgerReportWay: {},
	msgSubType: {},
	msgSendType: {},
	idCardORC: {},
	efaceStatus: {},
    //根行政区编码
    regionRoot: {code:'131081204000'},
    //根行政区坐标
    regionRootLocation: {
        xy: '117.000923,36.675807'
    },
    //设控人员类型
    mtypes: {
        1: "在逃人员",
        2: "重点监控人员",
        3: "信访人员"
	},
	//通知对象
	ttype: {
		1:'所有企业',
		2:'所有政府人员'
	},
	// 设备故障类型
	devFault: {},
    role: {},
    msgSendType:null,
	rc:null,
	echartUrl:null,
	// 权限列表
	powerList: {}
}
